In [61]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [9]:
df['col2'].unique()

array([444, 555, 666])

In [11]:
df['col2'].nunique()

3

In [13]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [27]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
newdf = df[(df['col1']>2)]

In [21]:
newdf

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [25]:
(df['col1']>2)

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [29]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [31]:
newdf

   col1  col2 col3
3     4   444  xyz

In [33]:
def times2(x):
    return x*2

In [39]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [41]:
df['col2'].apply(times2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [45]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [47]:
df['col3'].sum()

'abcdefghixyz'

In [49]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [53]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [55]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [57]:
del df['col1']

In [59]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [63]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [65]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [67]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [69]:
df.sort_index()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [71]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [73]:
df['col2'].sort_values()

0    444
3    444
1    555
2    666
Name: col2, dtype: int64

In [77]:
df.sort_values('col2',inplace=True)

In [79]:
df

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [83]:
df.sort_index(inplace=True)

In [86]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [88]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [121]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [123]:
df.fillna('Fill')

   col1   col2 col3
0   1.0   Fill  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  Fill  444.0  xyz

In [125]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [127]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [129]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [131]:
df.pivot_table(values='D',index=['A'],columns=['C','B'])

C      x         y
B    one  two  one  two
A
bar  4.0  NaN  1.0  5.0
foo  1.0  2.0  3.0  NaN